fish_m = """Абрамитес мраморный
Австралийский анчоус
Австралийский колючепер
Австралийский шишечник
Адамуссиус
Адский вампир
Азиатская зубатка
Акара голубовато-пятнистая
Акарихтис Хекеля
Акула азиатская кунья
Акула белая
Акула белоглазая
Акула белоперая
Акула большеротая
Акула галапагосская
Акула гигантская
Акула гренландская
Акула длиннокрылая
Акула звездчатошипая
Акула зебровая
Акула индонезийская
Акула китовая
Акула копьезубая
Акула коромандельская
Акула мальгашская
Акула мелкозубая
Акула Мицукури
Акула мозамбикская бычья
Акула ночная
Акула пепельная
Акула песчаная
Акула плащеносная
Акула плоскоголовая
Акула светящаяся
Акула Сейла
Акула серо-бурая
Акула серо-голубая
Акула суповая
Акула темноперая
Акула тигровая
Акула узкозубая
Акула черноперая
Акула шестижаберная
Акула-бык
Акула-домовой
Акула-лисица
Акула-молот обыкновенная
Акула черная
Акула эполетовая
Акула японская бычья
Акулеола черная
Алепизавр
Альбула
Ампуллярия
Амурская Щука
Амурский Осетр
Амурский Сиг
Анаконда
Ангел лирохвостый
Ангел черноплавничный
Антимора клюворылая
Апистограммова факельная
Аравана серебристая
Аравана черная
Арапаима
Аротрон белоточечный
Аррип большой
Аррип малый
Асаги
Астронотус глаздчатый
Атлантический Осетр
Аротрон колючий
Ауха
Багре гури
Багре негро
Багре хигучи
Барабулька
Барамунди
Барракуда
Белоглазка
Белуга
Белуга черноморская
Белуха
Бельдюга Андрияшева
Бельдюга восточная
Белый амур
Берикс австралийский
Берш
Бестер
Биара
Бикуда
Бисса
Болотная черепаха
Большая сериола
Большеротый окунь
Большой каранкс
Бонито
Бородавчатка
Бронзовая акула
Брызгун крупнопятнистый
Букцинум
Бутылконос плоскоголовый
Бутылконос северный
Быстрянка
Бычок
Бычок-кнут
Бычок-цуцик
Валаамка
Валек
Ваху
Венера воздушная
Верхогляд
Веслонос
Владиславия
Вобла
Волосозуб
Волютопсиус каштановый
Ворчун крапчатый
Восточная треска
Восточносибирский хариус
Вырезуб
Вьюн
Галаксия пятнистая
Галаксия Тасманская
Галаксия чилийская
Гигантская акула-молот
Гигантская тридакна
Гигантский головастик
Гигантский карп
Гидромедуза бразильская
Гимносарда
Гитарный скат
Глаукус
Глицимерис приморский
Глосса
Глубинная щука
Глубинный судак
Голавль
Голец альпийский
Голец арктический
Голец белый
Голец-кристивомер
Голец Леванидова
Голец Таранца
Голец усатый
Голец Черского
Голец чукотский
Голубая акула
Голубая линкия
Голубой марлин
Голубой тунец
Голый осман
Гольян Лаговского
Гольян Чекановского
Гонатус
Горбуша
Горбуша южноамериканская
Горбыль
Гребешок бело-розовый
Гребешок исландский
Гребешок коралловый
Гребешок лунный
Гребешок раскрашенный
Гребешок Свифта
Гребнистый крокодил
Греческий сосуд
Гринда короткоплавниковая
Группер Квинслендский
Губка-лира
Густера
Даватчан
Даллия
Дасцилл зебровидный
Двухцветная пеламида
Джакунда
Дианема полосатохвостая
Дискус зеленый
Дискус Хеккеля
Длиннопалый рак
Длинноперый тунец
Длиннорылый полурыл
Долгопер средиземноморский
Дорадо
Дорадо золотой
Дунайский пузанок
Евдошка европейская
Единорог расписной
Елец
Елец-андруга
Елец Сибирский
Ерш
Ерш носарь
Ершоватка
Желтопёрый тунец
Желтохвост
Желтощек
Жемчужная рыба
Жерех
Жерех-лысач
Зайцеголовый терпуг
Запрора
Звезда-подушка
Зебровый хирург
Зеленушка
Зеленый луциан
Змееголов
Змеиная макрель
Золотистая сериола
Золотистая скорпена
Золотистый линь
Зубатка дальневосточная
Зубатка полосатая
Зубатка пятнистая
Зубатка синяя
Идол мавританский
Императорский ангел
Инанга
Иния
Кайман гладколобый
Кайман крокодиловый
Кайман черный
Кайман широкомордый
Калинка
Каллиста короткосифонная
Каллитака Адамса
Каллихт
Калуга
Кальмар гигантский
Кальмар командорский
Кальмар обыкновенный
Кальмар тихоокеанский
Камбала двухлинейная
Камбала звёздчатая
Камбала зеленая
Камбала кесслера
Камбала морская
Камнеточец
Камчатский краб
Каракатица лечебная
Каракатица расписная
Карась золотой
Карась серебряный
Кардиум реснитчатый
Карп
Карп голый
Карп зеркальный
Картофельный группер
Катран
Катран вануатский
Каури-монета
Кашалот
Кашалот-альбинос
Кашалот карликовый
Кашорро краснохвостый
Керчак-яок
Кета
Кефаль алмазная
Кефаль-губач
Кефаль-лобан
Кижуч
Кижуч южноамериканский
Кит горбатый
Кит горбатый альбинос
Кит гренландский
Кит карликовый
Кит серый
Клюворыл
Клюворыл Шепарда
Коаро
Комета
Конголли
Конус географический
Кожистая черепаха
Кокани
Колоссома
Колючий краб
Колюшка девятииглая
Колюшка трехиглая
Коралловый группер
Королевский луциан
Корюшка
Косатка
Кохаку
Кошачья акула
Краб вельветовый
Краб-йети
Краб королевский
Краб красный мангровый
Краб Мраморный
Краб сине-красный
Красное бревно
Красноперка
Красный конгрио
Красный луциан
Креветка северная
Крокодил Джонстона
Крупночешуйчатый угай
Кряжевая палия
Кузовок-кубик
Кузовок рогатый
Кумжа
Кумжа южноамериканская
Кунджа
Кутум
Кэтфиш
Лабынкырская мальма
Лабынкырский хариус
Лабынкырский чёрт
Лаврак
Лазианциструс
Ламна
Ледяная рыба
Лемонема
Ленок
Ленский пескарь
Ленский хариус
Леопардовый группер
Лепоринус зебровый
Лепоринус фредерика
Лещ
Лещ Восточносибирский
Лещ морской белый
Лещ морской кинжальный
Лещ морской
Лещ черный южный
Ликодонт яванский
Лиманда длиннорылая
Лиманда желтохвостая
Линь
Логгерхед
Лососевая акула
Лосось
Лосось дунайский
Лосось Каспийский
Лосось Кларка
Лосось южноамериканский
Лоцман
Луварь
Лудога
Лудожная палия
Лунник
Луфарь
Лягушка
Лямбис подагрический
Мавританский клоун
Мазутный двухголов
Макома широкая
Макрель голубая
Макропинна
Мако длинноплавниковый
Макруронус новозеландский
Мактра китайская
Мактра сахалинская
Мактромерис изменчивый
Малабарский хоплиас
Малоглазый макрурус
Малый полосатик
Мальма
Мангровый джек
Мандаринка
Манта
Масляная рыба
Матамата
Мегалодон
Мелкозубый пилорыл
Мелкочешуйчатый краснопер
Мелкочешуйчатый угай
Менёк
Мерланг
Мерценария Стимпсона
Метиннис пятнистый
Мешкорот
Мидия
Микижа
Микижа чилийская
Миксина атлантическая
Милеус ленточный
Милоссома килебрюхая
Минтай
Моллюск
Монгольский краснопер
Морская звезда красношипая
Мойва
Мольва
Морская лисица
Морская очковая свинья
Морская свинья Далля
Морская свинья тихоокеанская
Морская собачка
Морской ворон
Морской еж
Морской монах
Морской орел
Морской финик
Морской черт
Моторо
Мускулус
Муксун
Муреная ячеистая
Мухтельский карась
Налим
Налим средиземноморский
Нанностом Бекфорда
Нарвал
Нейва
Нельма
Необерингиус Фрилея
Нереис
Нерка
Новозеландская мерлуза
Носатая энгидрина
Носорог пятнистый
Обыкновенный краб-стригун
Озерная форель
Озерный гольян
Окунь
Окунь алеутский
Окунь золотой
Окунь малый
Окунь северный морской
Омуль
Омуль Байкальский
Оникия
Оренжи Огон
Оринокский крокодил
Орфа
Осетр
Осетр Восточносибирский
Острорылый крокодил
Острорылый ленок
Осьминог обыкновенный
Офиура полосатая
Павлиний группер
Павлиний окунь-бабочка
Павлиний окунь королевский
Павлиний окунь ленточный
Пагелл красный
Пагр красный
Пайара
Пака
Палия
Палия американская
Палия южноамериканская
Палтус атлантический
Палтус Белокорый
Палтус синекорый
Палтус стрелозубый
Пальмовый вор
Парусник
Патагонский гребешок
Патагонский клыкач
Патагонский лобстер
Пеламида атлантическая
Пеленгас
Пелядь
Пенжинский омуль
Переславская ряпушка
Перечный слизняк
Перка
Перонидия жилковатая
Персидский осетр
Перуанский анчоус
Перуанская макрель
Перуанская сардина
Перуанская сериолелла
Перуанская ставрида
Пескарь
Пестрый конь
Пестрый толстолобик
Петушок
Пигоплит
Пикша
Пинагор
Пираиба
Пиракатинга
Пиранья вымпельная
Пиранья крапчатая
Пиранья краснобрюхая
Пиранья обыкновенная
Пиранья ромбовидная
Пиранья стройная
Пирапитинга
Пирапутанга
Пирарара
Пираруку
Пиратский клад
Плавун южный
Платинум Огон
Плотва
Подкаменщик
Подлещик
Подуст
Поллак
Полосатая камбала
Полосатик Брайда
Полосатик Идена
Полосатик карликовый
Полосатик южный
Полосатый марлин
Полярная акула
Помакант рябой
Попока
Пресноводный краб
Приморский гребешок
Промикропс
Прудовик
Птеригоплихт парчовый
Пузанок
Пустая бочка
Пыжьян
Пятиугольный волосатый краб
Пятнистая озерная лягушка
Пятнистый воббегонг
Пятнистый рак
Пятнистый сладкогуб
Пятнистый толстогуб
Радужная вариола
Радужная форель
Рак
Рапана
Рапана венозная
Рваный сапог
Ремнезуб атлантический
Ремнезуб Грея
Ремнезуб перуанский
Рипус
Робало
Рогатка
Розовый луциан
Ротан
Ручьевая форель
Рыба лира
Рыба меч
Рыба-бекас
Рыба-белка
Рыба-еж длинношипая
Рыба-капля
Рыба-лиса
Рыба-луна
Рыба-лягушка
Рыба-Наполеон
Рыба-ремень
Рыба-сабля
Рыбальдо
Рыбец
Ряпушка
Саблезуб
Сазан
Сайда
Сайра атлантическая
Саратога
Сарган
Сардина европейская
Сахалинская лиманда
Сахалинский осетр
Свинья аргентинская
Сева
Севанская форель
Северный клювач
Севрюга
Сейвал
Сельдяной король
Сельдь Каспийская
Семга
Сердцевидка съедобная
Серое бревно
Серрипес замечательный
Серцевидка
Сиб.голец-усач
Сибирская ряпушка
Сибирский подкаменщик
Сиг
Сиг-востряк
Сиг-Xадары
Сиган звездчатый
Сима
Сима южноамериканская
Синекольчатый осьминог
Синеплавниковый каранкс
Синеполосый луциан
Синец
Скалозуб бурый
Скалярия леопольда
Скат акулий
Скат акулохвостый
Скат гладкий
Скат колючий
Скат мозаичный
Скат-орляк австралийский
Скрипун
Скумбрия атлантическая
Солнечник обыкновенный
Солнечник синежаберный
Сом
Сом Амурский
Сом Солдатова
Сом Суруби
Сомалийская рыба-бабочка
Сомик леопардовый
Сом-плоскоголовик
Спинорог бело-зеленый
Спинорог голубоперый
Спинорог желтомордый
Спинорог заплаточный
Спинорог золотоплавниковый
Спинорог краснозубый
Спинорог крупнопятнистый
Спинорог оранжевополосый
Спинорог Пикассо
Спинорог расписной
Спинорог розовохвостый
Спинорог точечный
Старая покрышка
Стерлядь
Стерлядь Сибирская
Странствующий группер
Стройный группер
Стромбус волнистый
Стромбус королевский
Судак
Сферомия пятнистая
Сфирена мелкочешуйная
Таедо
Таймень
Тамбаку
Тарань
Тартаруга
Тасманский краб
Тасманский пескарь
Тасманский рак
Тауматихт Акселя
Тегу
Темно-бурый луциан
Терпуг бурый
Терпуг одноперый
Терпуг Стеллера
Тихоокеанская минога
Тихоокеанская навага
Тихоокеанская песчанка
Толстолобик
Томатный группер
Тракакса
Тукунаре
Тунец макрелевый
Тунец малый
Тунец южный
Тонкохвостый налим
Тонна гигантская
Тонна ленточная
Топь
Травяной краб
Тригла желтая
Троегуб
Тугун
Тунец полосатый
Тюрбо
Уару
Угольная рыба
Угорь
Угорь короткоребристый
Угорь электрический
Узо-угай
Уклейка
Украинская минога
Улитка
Усач
Усач Валецкого
Усач днепровский
Усач Итальянский
Уссурийская востробрюшка
Уссурийская касатка
Устрица
Утконос
Утсури
Фикус изящный
Флейторыл
Финвал
Финта
Форель мраморная
Фромия элегантная
Хапаку
Хараки
Хариус
Хариус Сибирский
Хвостокол Мацубары
Хемиодопсис
Хендфиш
Химера европейская
Хирург желтоплавничный
Хирург флаговый
Хирург-Ахиллес
Храмуля
Хризиптера сине-желтая
Целакант
Цихлазома мезонаута
Чавыча
Чавыча южноамериканская
Чебак
Черепаха
Черепаха зеленая
Черепаха саванная
Черноморская кумжа
Черноморская сельдь
Черноморская шемая
Чернохвостый луциан
Черный амур
Черный Лещ
Черный малакост
Черный макалор
Черный марлин
Черный нож
Четырехугольный волосатый краб
Чехонь
Чешуеед
Чилийская пеламида
Чилим
Чир
Чоп
Чукучан
Шабути
Шантарская микижа
Шашень
Шемая
Шип
Шортбилл
Шпрот европейский
Щука
Щучка Хьюжета
Южная мальма
Южная путассу
Ябби
Яго Гаррика
Язь
Якутский голец
Якутский карась
Якутский осетр
Ямабуки Огон
Японская макрель
Японский анчоус
Японский краб-стригун
Японский мохнаторукий краб
Ящерица каймановая
Байкальский осетр
Голомянка
Желтокрылка
Нерпа байкальская
Омуль баргузинский
Омуль маломорский
Омуль посольский
Омуль северобайкальский
Омуль селенгинский
Омуль чивыркуйский
Хариус байкальский белый
Хариус байкальский черный
Широколобка красная
Широколобка темная
Амия
Буффало большеротый
Буффало малоротый
Буффало черный
Дрейссена речная
Карп индийский
Краппи белый
Лаврак полосатый
Минога огайская
Мригал
Окунь каменный
Окунь красноглазый
Окунь малоротый
Окунь песчаный
Окунь прибрежный
Окунь пятнистый
Окунь ушастый
Осетр белый
Панцирник длиннорылый
Панцирник миссисипский
Рак красный флоридский
Рак сигнальный
Сомик американский
Сомик голубой
Сомик желтый
Сомик канальный
Сомик оливковый
Сомик черный
Черный краппи
Щука черная
Акула острозубая
Акула-собака
Архитеутис
Гребешок многообразный
Губан гребенчатый
Губан колючий
Губан носатый
Губан пятнистый
Губан радужный
Зубарик обыкновенный
Карась морской
Клюворыл
Краб снежный
Краб съедобный
Кракен
Лихия
Нарвал
Окунь морской золотистый
Окунь морской норвежский
Омар голубой
Омар европейский
Омар норвежский
Ореховидка тонкая
Осьминог семирукий
Сайка
Скат Йенсена
Скат короткохвостый
Скат круглый
Скат лучевой
Скат Монтегю
Скат полярный
Скат-кукушка
Треска атлантическая"""