base_mut ="""Амазония
Амга
Амур
Ахтуба
Байкал
Балаганнах
Большой Барьерный Риф
Большой Шантар
Буор-Юрях
Верхняя Тунгуска
Влтава
Волга
Волхов
Восточный Крит
Вуокса
Гренландия
Дема
Днепр-дельта
Днепр-Киев
Дунайский канал
Женевское озеро
Залив Александры
Золотая рыбка
Каналы Амстердама
Кенигзее
Киржач
Клязьма
Кола
Колпакова
Колыма	
Красивая меча
Кухтуй
Лабынкыр
Лопасня
Лофотенские острова
Майгунгна
Майн
Миссисипи
Москва центр
Нева
Озеро
Озеро Дав Лэйк
Патагонское озеро
Пахра
Паша
Пенжина
Переславль-Залесский
Побережье Камчатки
Побережье Чили
Подкаменная Тунгуска
Полинезия
Рыбхоз
Сара
Свирь
Северная Ладога
Сейшельские острова
Селигер
Суздаль
Ундюлюнг
Урал
Фирвальдштетское озеро
Хопёр
Хороту
Чаган
Юго-восточное побережье"""